app/views/pictures/show.html.erb


        <% @picture.reviews.each do |review| %>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."picture_id" = $1  [["picture_id", 3]]