app/controllers/pictures_controller.rb

  def create


    # Shovel everything into picture_params
    @picture = Picture.new(picture_params)
    @picture.googleVision

    respond_to do |format|
      if @picture.save
---
INSERT INTO "pictures" ("url", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["url", "http://www.relatably.com/m/img/memes-surprised-face/4095fc068ce7012ee07baf11a8ef3a0f.jpg"], ["created_at", 2016-11-07 01:17:19 UTC], ["updated_at", 2016-11-07 01:17:19 UTC]]

  def update
    respond_to do |format|
      if @picture.update(picture_params)
---
UPDATE "pictures" SET "url" = $1, "updated_at" = $2 WHERE "pictures"."id" = $3

  def destroy
    @picture.destroy
---
DELETE FROM "pictures" WHERE "pictures"."id" = $1  [["id", 21]]

    def set_picture
      @picture = Picture.find(params[:id])
---
SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = $1 LIMIT $2  [["id", 40], ["LIMIT", 1]]