app/controllers/reviews_controller.rb

  def create
    @review = Review.new(review_params)

    respond_to do |format|
      if @review.save
---
INSERT INTO "reviews" ("comment", "picture_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["comment", "This is dope!"], ["picture_id", 1], ["created_at", 2016-11-07 01:04:19 UTC], ["updated_at", 2016-11-07 01:04:19 UTC]]